notes/meeting_2021mar28.org
* meeting notes Mar 28, 2021
** topics
*** news: perl foundation project to improve raku docs
**** https://perl-foundation-outreach.github.io/season-of-docs-ideas/docs.html
***** some of the ideas include documenting exceptions and traits better
***** they're looking for suggestions for big things to fix (not our usual bug reports to JJ)
*** extracting results from grammar matches
**** alternate example, works
/home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/ini_file_parsing_with_zoffix_grammar.raku
**** narrow down what was wrong with moritz lenz inifile
***** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/ini_file_parsing_with_moritz_lenz_grammar.raku
*** grammar to parse doomfiles
**** simple scripts, e.g. scan through browse sequence
*** review continuing discussion of regex interpolation with captures
**** open an issue, I think.


bruce gray shows us some rosettacode working with 
lazy lists to get a list of primes with monotonically 
increasing differences: 

http://rosettacode.org/wiki/Next_special_primes#Raku


destructured syntax:

sub is-special ( ($previous, $gap) ) {

sub requires a list of two elements, unpacked by convenience
into those names.  (Bet I can use this instead of $pair) 


 liz code, willima michels mentions:


> #Liz IRC
Nil
> my @a = 3,7,6,12,9,6,6,6; say @a.first(6, :k)
2 


next meeting on april 11th, taking a break for easter
