notes/meeting_2021mar28.md
- [meeting notes Mar 28, 2021](#org1ae4d69)
  - [topics](#orgf253031)
    - [news: perl foundation project to improve raku docs](#orgbda3a51)
    - [extracting results from grammar matches](#orgd582c28)
    - [grammar to parse doomfiles](#orgd000fd3)
    - [review continuing discussion of regex interpolation with captures](#orgef45bd1)


<a id="org1ae4d69"></a>

# meeting notes Mar 28, 2021


<a id="orgf253031"></a>

## topics


<a id="orgbda3a51"></a>

### news: perl foundation project to improve raku docs

1.  <https://perl-foundation-outreach.github.io/season-of-docs-ideas/docs.html>

    1.  some of the ideas include documenting exceptions and traits better
    
    2.  they're looking for suggestions for big things to fix (not our usual bug reports to JJ)


<a id="orgd582c28"></a>

### extracting results from grammar matches

1.  alternate example, works

    /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/ini<sub>file</sub><sub>parsing</sub><sub>with</sub><sub>zoffix</sub><sub>grammar.raku</sub>

2.  narrow down what was wrong with moritz lenz inifile

    1.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/ini<sub>file</sub><sub>parsing</sub><sub>with</sub><sub>moritz</sub><sub>lenz</sub><sub>grammar.raku</sub>


<a id="orgd000fd3"></a>

### grammar to parse doomfiles

1.  simple scripts, e.g. scan through browse sequence


<a id="orgef45bd1"></a>

### review continuing discussion of regex interpolation with captures

1.  open an issue, I think.

    bruce gray shows us some rosettacode working with lazy lists to get a list of primes with monotonically increasing differences:
    
    <http://rosettacode.org/wiki/Next_special_primes#Raku>
    
    destructured syntax:
    
    sub is-special ( ($previous, $gap) ) {
    
    sub requires a list of two elements, unpacked by convenience into those names. (Bet I can use this instead of $pair)
    
    liz code, willima michels mentions:
    
    > #Liz IRC Nil > my @a = 3,7,6,12,9,6,6,6; say @a.first(6, :k) 2
    
    next meeting on april 11th, taking a break for easter
